In [5]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('stu.csv')
df

   id    name  score           city
0   5   David     88        Phoenix
1   6   Alice     76  San Francisco
2   7  Robert     81        Seattle
3   8  Olivia     95          Miami
4   9  Daniel     80         Boston
5  10     Mia     89        Atlanta

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int64
 1   name    6 non-null      object
 2   score   6 non-null      int64
 3   city    6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [4]:
df.memory_usage(deep=True)

Index    132
id        48
name     373
score     48
city     387
dtype: int64

In [9]:
df['id'] = df['id'].astype(np.int8)
df['score'] = df['score'].astype(np.int8)

In [10]:
df.memory_usage(deep=True)

Index    132
id         6
name     373
score      6
city     387
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int8
 1   name    6 non-null      object
 2   score   6 non-null      int8
 3   city    6 non-null      object
dtypes: int8(2), object(2)
memory usage: 240.0+ bytes

In [13]:
df

   id    name  score           city
0   5   David     88        Phoenix
1   6   Alice     76  San Francisco
2   7  Robert     81        Seattle
3   8  Olivia     95          Miami
4   9  Daniel     80         Boston
5  10     Mia     89        Atlanta

In [14]:
df['city'] = df['city'].astype('category')

In [15]:
df.memory_usage(deep=True)

Index    132
id         6
name     373
score      6
city     565
dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      6 non-null      int8
 1   name    6 non-null      object
 2   score   6 non-null      int8
 3   city    6 non-null      category
dtypes: category(1), int8(2), object(1)
memory usage: 418.0+ bytes

In [19]:
df.isna().sum()

id       0
name     0
score    0
city     0
dtype: int64